Autodesk.Revit.ApplicationServices.LanguageType
An enumerated type containing the supported Revit product languages.

Autodesk.Revit.ApplicationServices.LanguageType.English_GB
English - United Kingdom.

Autodesk.Revit.ApplicationServices.LanguageType.Brazilian_Portuguese
Brazilian Portuguese.

Autodesk.Revit.ApplicationServices.LanguageType.Hungarian
Hungarian.

Autodesk.Revit.ApplicationServices.LanguageType.Polish
Polish.

Autodesk.Revit.ApplicationServices.LanguageType.Czech
Czech.

Autodesk.Revit.ApplicationServices.LanguageType.Russian
Russian.

Autodesk.Revit.ApplicationServices.LanguageType.Korean
Korean.

Autodesk.Revit.ApplicationServices.LanguageType.Japanese
Japanese.

Autodesk.Revit.ApplicationServices.LanguageType.Chinese_Traditional
Chinese traditional.

Autodesk.Revit.ApplicationServices.LanguageType.Chinese_Simplified
Chinese simplified.

Autodesk.Revit.ApplicationServices.LanguageType.Dutch
Dutch.

Autodesk.Revit.ApplicationServices.LanguageType.Italian
Italian.

Autodesk.Revit.ApplicationServices.LanguageType.French
French.

Autodesk.Revit.ApplicationServices.LanguageType.Spanish
Spanish.

Autodesk.Revit.ApplicationServices.LanguageType.German
German.

Autodesk.Revit.ApplicationServices.LanguageType.English_USA
English USA.

Autodesk.Revit.ApplicationServices.LanguageType.Unknown
Unknown.